# pandas tutorial

# Series

# Data Frame

# import necessary libraries

In [1]:
import pandas as pd

In [2]:
s1=pd.Series([1,2,3,4])

In [3]:
s1

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
s2=pd.Series(['farhan','daud'])

In [6]:
s2

0    farhan
1      daud
dtype: object

In [15]:
names=pd.Series([6562,6563,7766,8977,2456],index=['farhan','daud','minhal','hafiz','mahira'],name='class_data')

In [16]:
names

farhan    6562
daud      6563
minhal    7766
hafiz     8977
mahira    2456
Name: class_data, dtype: int64

In [17]:
Canteen_data=pd.Series([10,20,30,40,10,35,50],index=['Monday','Tuesday','Wednesday','Thursday','Friday','Saturday','Sunday'],name="7 Days Canteen Data")

In [18]:
Canteen_data

Monday       10
Tuesday      20
Wednesday    30
Thursday     40
Friday       10
Saturday     35
Sunday       50
Name: 7 Days Canteen Data, dtype: int64

In [20]:
Canteen_data[2]

30

In [23]:
Canteen_data[6]

50

In [25]:
Canteen_data['Wednesday']

30

In [26]:
Canteen_data[[3,5,4]]

Thursday    40
Saturday    35
Friday      10
Name: 7 Days Canteen Data, dtype: int64

In [31]:
Canteen_data['Monday']=10

In [32]:
Canteen_data

Monday       10
Tuesday      20
Wednesday    30
Thursday     40
Friday       10
Saturday     35
Sunday       50
Name: 7 Days Canteen Data, dtype: object

In [33]:
Canteen_data*2

Monday        20
Tuesday       40
Wednesday     60
Thursday      80
Friday        20
Saturday      70
Sunday       100
Name: 7 Days Canteen Data, dtype: object

In [34]:
Canteen_data[Canteen_data>20]

Wednesday    30
Thursday     40
Saturday     35
Sunday       50
Name: 7 Days Canteen Data, dtype: object

# DATA FRAMES

In [43]:
Names=pd.Series(['Farhan','Daud','Minhaal','Hafiz'])

In [44]:
Names

0     Farhan
1       Daud
2    Minhaal
3      Hafiz
dtype: object

In [45]:
Roll=pd.Series([6562,6563,6523,6548])

In [46]:
Roll

0    6562
1    6563
2    6523
3    6548
dtype: int64

In [47]:
Dict={"Names": Names,
     "Roll": Roll}

In [52]:
df=pd.DataFrame(Dict)

In [53]:
df

     Names  Roll
0   Farhan  6562
1     Daud  6563
2  Minhaal  6523
3    Hafiz  6548

In [55]:
dict2={"Names":['Farhan','javeria','daud','hafiz','ali','yashal','arooj','zoya','faiza'],
      "Roll":[65,78,98,78,60,67,98,28,78],
      "city":['lhr','lhr','fsd','fsd','khi','isb','guj','jhang','lhr']}

In [56]:
df=pd.DataFrame(dict2)

In [57]:
df

     Names  Roll   city
0   Farhan    65    lhr
1  javeria    78    lhr
2     daud    98    fsd
3    hafiz    78    fsd
4      ali    60    khi
5   yashal    67    isb
6    arooj    98    guj
7     zoya    28  jhang
8    faiza    78    lhr

In [59]:
df.head(6)

     Names  Roll city
0   Farhan    65  lhr
1  javeria    78  lhr
2     daud    98  fsd
3    hafiz    78  fsd
4      ali    60  khi
5   yashal    67  isb

In [61]:
df.tail()

    Names  Roll   city
4     ali    60    khi
5  yashal    67    isb
6   arooj    98    guj
7    zoya    28  jhang
8   faiza    78    lhr

In [62]:
df.shape

(9, 3)

In [63]:
df.size

27

In [64]:
df.sample(3)

     Names  Roll   city
8    faiza    78    lhr
7     zoya    28  jhang
1  javeria    78    lhr

In [65]:
df.columns

Index(['Names', 'Roll', 'city'], dtype='object')

In [67]:
df.info

<bound method DataFrame.info of      Names  Roll   city
0   Farhan    65    lhr
1  javeria    78    lhr
2     daud    98    fsd
3    hafiz    78    fsd
4      ali    60    khi
5   yashal    67    isb
6    arooj    98    guj
7     zoya    28  jhang
8    faiza    78    lhr>

In [68]:
df

     Names  Roll   city
0   Farhan    65    lhr
1  javeria    78    lhr
2     daud    98    fsd
3    hafiz    78    fsd
4      ali    60    khi
5   yashal    67    isb
6    arooj    98    guj
7     zoya    28  jhang
8    faiza    78    lhr

In [69]:
df['Names']

0     Farhan
1    javeria
2       daud
3      hafiz
4        ali
5     yashal
6      arooj
7       zoya
8      faiza
Name: Names, dtype: object

In [70]:
df['country']='Pakistan'

In [71]:
df

     Names  Roll   city   country
0   Farhan    65    lhr  Pakistan
1  javeria    78    lhr  Pakistan
2     daud    98    fsd  Pakistan
3    hafiz    78    fsd  Pakistan
4      ali    60    khi  Pakistan
5   yashal    67    isb  Pakistan
6    arooj    98    guj  Pakistan
7     zoya    28  jhang  Pakistan
8    faiza    78    lhr  Pakistan

In [72]:
df['country']=['Pakistan','canada','sedney','autrailia','uk','paris','turkey','korea','india']

In [73]:
df

     Names  Roll   city    country
0   Farhan    65    lhr   Pakistan
1  javeria    78    lhr     canada
2     daud    98    fsd     sedney
3    hafiz    78    fsd  autrailia
4      ali    60    khi         uk
5   yashal    67    isb      paris
6    arooj    98    guj     turkey
7     zoya    28  jhang      korea
8    faiza    78    lhr      india